# Програма може виконувати різні арифметичні операції над двома числами
# Імпортуємо модуль math


from math import sqrt

N = int(input())
M = int(input())

a = N + M         # Знаходимо суму двох чисел
print("Сума двох чисел", a)

b = N - M         # Знаходимо різницю двох чисел
print("Різниця двох чисел", b)

c = N * M         # Знаходимо добуток двох чисел
print("Добуток двох чисел", c)

d = N // M        # Знаходимо частку від ділення
print("Частка від ділення", d)

e = N ** M        # Підносимо число до степеня
print("Значення числа N в степені M", e)

f = N**2+2*N*M+M**2   # Знаходимо квадрат суми двох чисел
print("Квадрат суми двох чисел", f)

g = N**2-2*N*M+M**2   # Знаходимо квадрат різниці двох чисел
print("Квадрат різниці двох чисел", g)

h = (N * M)**2      # Знаходимо квадрат добутку двох чисел
print("Квадрат добутку двох чисел", h)

i = (N // M)**2     # Знаходимо квадрат частки двох чисел
print("Квадрат частки двох чисел", i)

j = N**3+3*N**2*M+3*N*M**2+M**3   # Знаходимо куб суми двох чисел
print("Куб суми двох чисел", j)

k = N**3-3*N**2*M+3*N*M**2-M**2   # Знаходимо куб різниці двох чисел
print("Куб різниці двох чисел", k)

l = (N * M)**3   # Знаходимо куб добутку двох чисел
print("Куб добутку двох чисел", l)

m = (N // M)**3  # Знаходимо куб частки двох чисел
print("Куб частки двох чисел", m)

n = sqrt(N+M) # Знаходимо квадратний корінь двох чисел
print("Квадратний корінь суми двох чисел", n)

